Config/Documents/РасчетРасходовНаОСиНМАПриУСН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>РасчетРасходовНаОСиНМАПриУСН</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.КнигаУчетаДоходовИРасходовОСиНМА</xr:Item>
				<xr:Item>InformationRegister.РасшифровкаКУДиР</xr:Item>
				<xr:Item>AccountingRegister.ЖурналПроводокЕПСБУ</xr:Item>
				<xr:Item>AccumulationRegister.КнигаУчетаДоходовИРасходов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОСиНМА</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИФО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КФО</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КВД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсновноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОплаты</Name>
							<Comment>Документ оплаты (УСН)</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходыПроизведеныДоПереходаНаУСН</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОплаты</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПодачиДокументовНаГосРегистрацию</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВводаВЭксплуатацию</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПервоначальнаяСтоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстаточнаяСтоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокПолезногоИспользования</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоКварталовВНалоговомПериоде</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоляСтоимостиЗаНалоговыйПериод</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоляСтоимостиЗаКвартал</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРасходовЗаКвартал</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРасходовЗаНалоговыйПериод</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходыПрошлыхПериодов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОставшаясяЧастьРасходов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВыбытия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПризнанныеРасходыУСН</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчета</Name>
							<Type>
								<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходыУСН</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РасходыУСН</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СписатьСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СписатьНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СписатьНеУчитываетсяНУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СписатьЕНВД</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/InformationRegisters/ПервоначальныеСведенияОСНалоговыйУчетУСН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПервоначальныеСведенияОСНалоговыйУчетУСН</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СрокПолезногоИспользованияУСН</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокВключенияСтоимостиВСоставРасходовУСН</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокВключенияСтоимостиОСиНМАВСоставРасходовУСН</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/СобытияОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СобытияОС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПричинаСписания</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПричинаСписания</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазваниеДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИнвНомер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнвентарныеНомераОС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСобытийОС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Enums/ВидыСобытийОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыСобытийОС</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПринятиеКУчету</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводВЭксплуатацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнутреннееПеремещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КапитальныйРемонт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переоценка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реконструкция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Списание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Прочие состояния (пользовательские)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СдачаВАренду</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаВБезвозмездноеПользование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратИзАренды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратИзБезвозмездногоПользования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Консервация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расконсервация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаВЛичноеПользование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратИзЛичногоПользования</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Documents/РасчетРасходовНаОСиНМАПриУСН/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// См. УправлениеДоступом.ЗаполнитьНаборыЗначенийДоступа.
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	// Логика ограничения:
	// Чтения:     Организация
	// Изменения:  Организация
	
	// Чтение, Изменение: набор №0.
	Строка = Таблица.Добавить();
	Строка.ЗначениеДоступа = Организация;
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
	РеквизитыОСиНМА = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(
		ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(ОСиНМА.ВыгрузитьКолонку("ОсновноеСредство")),
			"ВидНФА,ГрупповойУчет");
	
	Для Каждого СтрокаТаблицы Из ОСиНМА Цикл
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.ОсновноеСредство)
			И РеквизитыОСиНМА[СтрокаТаблицы.ОсновноеСредство].ГрупповойУчет Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не предусмотрено включение в расходы УСН с одновременным отражением в разделе II Книги учета доходов и расходов (КУДиР) объектов ОС, НМА с групповым учетом.
				|Для объекта ""%1"" в документе принятия к учету следует выбрать порядок отражения в УСН ""Включить в материальные расходы"" (пп.1 п.2 статьи 346.17 НК РФ).'"),
					СтрокаТаблицы.ОсновноеСредство);
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка", "Корректность",
				НСтр("ru = 'ОС (НМА)'"),
				СтрокаТаблицы.НомерСтроки, НСтр("ru = 'Расчет расходов на ОС и НМА'"),
				ТекстОшибки);
			ПолеОшибки = "ОСиНМА[" + Формат(СтрокаТаблицы.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].ОсновноеСредство";
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, ПолеОшибки, "Объект", Отказ);
		КонецЕсли;
		
	КонецЦикла;
	
	УчетУСН.ПроверитьКорректностьЗаполненияТаблицыРасходовНаОСиНМА(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// Инициализация дополнительных свойств для проведения документа
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	
	// Подготовка наборов записей
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Инициализация данных документа
	Документы.РасчетРасходовНаОСиНМАПриУСН.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Движения по регистрам КнигаУчетаДоходовИРасходов и РасшифровкаКУДиР выполняются при формировании проводок
	// по счетам УСН общим алгоритмом УчетУСН.СформироватьДвиженияПоНалоговомуУчетуУСН.
	ПроведениеСервер.ОтразитьДвиженияПоРегистру(ДополнительныеСвойства, Движения, Отказ, "КнигаУчетаДоходовИРасходовОСиНМА");

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для проведения документа
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

	Ответственный = Пользователи.ТекущийПользователь();

КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеДокумента

// Выполняет расчет расходов и заполняет документ.
//
Процедура ЗаполнитьДокумент(ПараметрыЗаполнения) Экспорт

	Если Проведен Тогда
		Записать(РежимЗаписиДокумента.ОтменаПроведения);
	КонецЕсли;
	
	// Пп. 3 п.3 статьи 346.16 НК РФ.
	ДобавитьРасходыПоОСиНМАПриобретеннымДоПереходаНаУСН("ВводНачальныхОстатков");	// старый
	ДобавитьРасходыПоОСиНМАПриобретеннымДоПереходаНаУСН("ВводНачальныхОстатковОС");	// новый
	
	// Пп. 1-2 п.3 статьи 346.16 НК РФ.
	ДобавитьРасходыПоОСиНМАПриобретеннымВПериодПримененияУСН();
	
КонецПроцедуры

Процедура ДобавитьРасходыПоОСиНМАПриобретеннымДоПереходаНаУСН(ВидДокументаВводаОстатков)
	
	УчетнаяПолитика = БухгалтерскийУчетПовтИсп.УчетнаяПолитикаОрганизации(Организация, Дата);
	
	// Получаем оплаченные расходы по ОС и НМА, приобретенным до перехода на УСН.
	// По ОС и НМА, приобретенным в период применения УСН, все расходы принимаются в том налоговом периоде,
	// в котором была произведена оплата. Переходящих остатков на следующий год быть не может.
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕПСБУОстатки.Организация КАК Организация,
	|	ЕПСБУОстатки.ИФО КАК ИФО,
	|	ЕПСБУОстатки.КФО КАК КФО,
	|	ЕПСБУОстатки.КПС КАК КПС,
	|	ЕПСБУОстатки.Подразделение КАК Подразделение,
	|	ЕПСБУОстатки.Счет КАК Счет,
	|	ВЫРАЗИТЬ(ЕПСБУОстатки.Субконто1 КАК Справочник.ОсновныеСредства) КАК ОсновноеСредство,
	|	ВЫРАЗИТЬ(ЕПСБУОстатки.Субконто2 КАК Справочник.РасходыУСН) КАК РасходыУСН,
	|	ЕПСБУОстатки.Субконто3 КАК ДокументОплаты,
	|	ЕПСБУОстатки.СуммаОстатокДт,
	|	ЕПСБУОстатки.СуммаНеУчитываетсяНУОстатокДт,
	|	ЕПСБУОстатки.СуммаЕНВДОстатокДт,
	|	ЕПСБУОстатки.СуммаНДСОстатокДт
	|ПОМЕСТИТЬ РасходыКПризнанию
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(&КонецПредыдущегоГода, Счет В (&СчетаРасходовНаОСиНМАкПризнанию), &Субконто, Организация = &Организация) КАК ЕПСБУОстатки
	|ГДЕ
	|	ВЫРАЗИТЬ(ЕПСБУОстатки.Субконто2 КАК Справочник.РасходыУСН).Партия ССЫЛКА Документ.ВводНачальныхОстатков
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство,
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПервоначальныеСведенияОС.ОсновноеСредство,
	|	ПервоначальныеСведенияОС.СрокПолезногоИспользованияУСН,
	|	ПервоначальныеСведенияОС.ПорядокВключенияСтоимостиВСоставРасходовУСН
	|ПОМЕСТИТЬ ПервоначальныеСведенияОС
	|ИЗ
	|	РегистрСведений.ПервоначальныеСведенияОСНалоговыйУчетУСН.СрезПоследних(
	|			&КонецПредыдущегоГода,
	|			Организация = &Организация
	|				И ОсновноеСредство В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						РасходыКПризнанию.ОсновноеСредство
	|					ИЗ
	|						РасходыКПризнанию)) КАК ПервоначальныеСведенияОС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КнигаУчетаДоходовИРасходовОСиНМАОбороты.ОсновноеСредство КАК ОсновноеСредство,
	|	КнигаУчетаДоходовИРасходовОСиНМАОбороты.ДатаОплаты КАК ДатаОплаты,
	|	СУММА(КнигаУчетаДоходовИРасходовОСиНМАОбороты.СуммаРасходовЗаКварталОборот) КАК СуммаРасходов
	|ПОМЕСТИТЬ РасходыПредыдущихНалоговыхПериодов
	|ИЗ
	|	РегистрНакопления.КнигаУчетаДоходовИРасходовОСиНМА.Обороты(
	|			,
	|			&КонецПредыдущегоГода,
	|			,
	|			Организация = &Организация
	|				И ОсновноеСредство В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						РасходыКПризнанию.ОсновноеСредство
	|					ИЗ
	|						РасходыКПризнанию)) КАК КнигаУчетаДоходовИРасходовОСиНМАОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	КнигаУчетаДоходовИРасходовОСиНМАОбороты.ОсновноеСредство,
	|	КнигаУчетаДоходовИРасходовОСиНМАОбороты.ДатаОплаты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство,
	|	ДатаОплаты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КнигаУчетаДоходовИРасходовОСиНМАОбороты.ОсновноеСредство КАК ОсновноеСредство,
	|	КнигаУчетаДоходовИРасходовОСиНМАОбороты.ДатаОплаты КАК ДатаОплаты,
	|	СУММА(КнигаУчетаДоходовИРасходовОСиНМАОбороты.СуммаРасходовЗаКварталОборот) КАК СуммаРасходов
	|ПОМЕСТИТЬ РасходыТекущегоНалоговогоПериода
	|ИЗ
	|	РегистрНакопления.КнигаУчетаДоходовИРасходовОСиНМА.Обороты(
	|			&НачалоГода,
	|			&КонецКвартала,
	|			,
	|			Организация = &Организация
	|				И ОсновноеСредство В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						РасходыКПризнанию.ОсновноеСредство
	|					ИЗ
	|						РасходыКПризнанию)) КАК КнигаУчетаДоходовИРасходовОСиНМАОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	КнигаУчетаДоходовИРасходовОСиНМАОбороты.ОсновноеСредство,
	|	КнигаУчетаДоходовИРасходовОСиНМАОбороты.ДатаОплаты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство,
	|	ДатаОплаты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасходыКПризнанию.Организация,
	|	РасходыКПризнанию.ИФО КАК ИФО,
	|	РасходыКПризнанию.КФО КАК КФО,
	|	РасходыКПризнанию.КПС КАК КПС,
	|	РасходыКПризнанию.Подразделение КАК Подразделение,
	|	РасходыКПризнанию.Счет КАК СчетУчета,
	|	РасходыКПризнанию.ОсновноеСредство КАК ОсновноеСредство,
	|	РасходыКПризнанию.ОсновноеСредство.ВидНФА КАК ВидНФА,
	|	РасходыКПризнанию.РасходыУСН,
	|	РасходыКПризнанию.ДокументОплаты,
	|	РасходыКПризнанию.СуммаОстатокДт КАК ОстатокРасходовКПризнанию,
	|	РасходыКПризнанию.СуммаНеУчитываетсяНУОстатокДт КАК ОстатокРасходовКПризнаниюНеУчитываетсяНУ,
	|	РасходыКПризнанию.СуммаЕНВДОстатокДт КАК ОстатокРасходовКПризнаниюЕНВД,
	|	РасходыКПризнанию.СуммаНДСОстатокДт КАК ОстатокРасходовКПризнаниюНДС,
	|	ВводОстатковОС.СуммаОплаченныхРасходовРуб КАК ОстаточнаяСтоимостьУСН,
	|	ВводОстатковОС.ДатаОплаты КАК ДатаОплаты,
	|	ПервоначальныеСведенияОС.ПорядокВключенияСтоимостиВСоставРасходовУСН,
	|	ПервоначальныеСведенияОС.СрокПолезногоИспользованияУСН,
	|	ПринятиеКУчету.ДатаСобытия КАК ДатаПринятияКУчету,
	|	ВводВЭксплуатацию.ДатаСобытия КАК ДатаВводаВЭксплуатацию,
	|	Выбытие.ДатаСобытия КАК ДатаВыбытия,
	|	ЕСТЬNULL(РасходыПредыдущихНалоговыхПериодов.СуммаРасходов, 0) КАК РасходыПрошлыхПериодов,
	|	ЕСТЬNULL(РасходыТекущегоНалоговогоПериода.СуммаРасходов, 0) КАК СуммаРасходовЗаНалоговыйПериод
	|ИЗ
	|	РасходыКПризнанию КАК РасходыКПризнанию
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводНачальныхОстатков.ОС_РасходыУСН КАК ВводОстатковОС
	|			ЛЕВОЕ СОЕДИНЕНИЕ РасходыПредыдущихНалоговыхПериодов КАК РасходыПредыдущихНалоговыхПериодов
	|			ПО ВводОстатковОС.ОС = РасходыПредыдущихНалоговыхПериодов.ОсновноеСредство
	|				И ВводОстатковОС.ДатаОплаты = РасходыПредыдущихНалоговыхПериодов.ДатаОплаты
	|			ЛЕВОЕ СОЕДИНЕНИЕ РасходыТекущегоНалоговогоПериода КАК РасходыТекущегоНалоговогоПериода
	|			ПО ВводОстатковОС.ОС = РасходыТекущегоНалоговогоПериода.ОсновноеСредство
	|				И ВводОстатковОС.ДатаОплаты = РасходыТекущегоНалоговогоПериода.ДатаОплаты
	|		ПО РасходыКПризнанию.РасходыУСН.Партия = ВводОстатковОС.Ссылка
	|			И РасходыКПризнанию.РасходыУСН.НомерСтрокиДокумента = ВводОстатковОС.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СобытияОС КАК ПринятиеКУчету
	|		ПО (ПринятиеКУчету.Событие = ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ПринятиеКУчету))
	|			И РасходыКПризнанию.ОсновноеСредство = ПринятиеКУчету.ОсновноеСредство
	|			И РасходыКПризнанию.Организация = ПринятиеКУчету.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СобытияОС КАК ВводВЭксплуатацию
	|		ПО (ВводВЭксплуатацию.Событие = ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ВводВЭксплуатацию))
	|			И РасходыКПризнанию.ОсновноеСредство = ВводВЭксплуатацию.ОсновноеСредство
	|			И РасходыКПризнанию.Организация = ВводВЭксплуатацию.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СобытияОС КАК Выбытие
	|		ПО (Выбытие.Событие В (ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.Списание)))
	|			И РасходыКПризнанию.ОсновноеСредство = Выбытие.ОсновноеСредство
	|			И РасходыКПризнанию.Организация = Выбытие.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПервоначальныеСведенияОС КАК ПервоначальныеСведенияОС
	|		ПО РасходыКПризнанию.ОсновноеСредство = ПервоначальныеСведенияОС.ОсновноеСредство
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИФО,
	|	КФО,
	|	КПС,
	|	Подразделение,
	|	ОсновноеСредство,
	|	ДатаОплаты";
	
	Запрос.УстановитьПараметр("НачалоГода",           НачалоГода(Дата));
	Запрос.УстановитьПараметр("КонецКвартала",        Новый Граница(КонецКвартала(Дата), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("КонецПредыдущегоГода", Новый Граница(КонецГода(НачалоГода(Дата) - 1), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация",          Организация);
	
	Запрос.УстановитьПараметр("СчетаРасходовНаОСиНМАкПризнанию",
		БухгалтерскийУчет.СписокСчетов("У01.П,У04.П") );
	
	МассивСубконто = Новый Массив;
	МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ОсновныеСредства);
	МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.РасходыУСН);
	МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ДокументыОплатыУСН);
	Запрос.УстановитьПараметр("Субконто", МассивСубконто);
	
	Если ВидДокументаВводаОстатков = "ВводНачальныхОстатковОС" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.ВводНачальныхОстатков", "Документ.ВводНачальныхОстатковОС");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ОС_РасходыУСН", "РасходыУСН");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВводОстатковОС.ОС", "ВводОстатковОС.Ссылка.ОсновноеСредство");
	КонецЕсли;
	
	ОплаченныеРасходыКПризнанию = Запрос.Выполнить().Выгрузить();
	
	// Заполняем документ.
	ТекущееОсновноеСредство = Неопределено;
	ТекущаяДатаОплаты       = Неопределено;
	
	Для Каждого Строка Из ОплаченныеРасходыКПризнанию Цикл
		
		Если ЗначениеЗаполнено(Строка.ДатаВыбытия) И (НЕ Год(Строка.ДатаВыбытия) = Год(Дата)) Тогда
			Продолжить; // Объект ОС, НМА выбыл в предыдущие годы.
		КонецЕсли;
		
		Если (Строка.ОсновноеСредство <> ТекущееОсновноеСредство)
		 ИЛИ (Строка.ДатаОплаты <> ТекущаяДатаОплаты) Тогда
		
			СтрокаОСиНМА = ОСиНМА.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаОСиНМА, Строка,
				"ИФО,КФО,КПС,Подразделение,
				|ОсновноеСредство,ДокументОплаты,ДатаОплаты,ДатаВыбытия");
			СтрокаОСиНМА.ИдСтроки = ОСиНМА.Количество();
			СтрокаОСиНМА.РасходыПроизведеныДоПереходаНаУСН = Истина;
			
			Если Строка.ВидНФА = Перечисления.ВидыНФА.НМА Тогда
				СтрокаОСиНМА.ДатаВводаВЭксплуатацию = Строка.ДатаПринятияКУчету;
			Иначе
				СтрокаОСиНМА.ДатаВводаВЭксплуатацию = Строка.ДатаВводаВЭксплуатацию;
			КонецЕсли;
			
			// ДатаПодачиДокументовНаГосРегистрацию не заполняем. При необходимости, можно заполнить в документе вручную.
			
			СтрокаОСиНМА.СрокПолезногоИспользования = Строка.СрокПолезногоИспользованияУСН;
			СтрокаОСиНМА.РасходыПрошлыхПериодов     = Строка.РасходыПрошлыхПериодов;
			
			СтрокаОСиНМА.ДоляСтоимостиЗаНалоговыйПериод = УчетУСНКлиентСервер.ДоляСтоимостиОСиНМАЗаНалоговыйПериод(
				СтрокаОСиНМА.РасходыПроизведеныДоПереходаНаУСН,
				Дата, УчетнаяПолитика.ДатаПереходаНаУСН, СтрокаОСиНМА.СрокПолезногоИспользования);
			
			// В течение налогового периода расходы принимаются за отчетные периоды равными долями (пп.3 п.3 ст.346.16 НК РФ).
			СтрокаОСиНМА.КоличествоКварталовВНалоговомПериоде = 4;
			СтрокаОСиНМА.ДоляСтоимостиЗаКвартал =
				СтрокаОСиНМА.ДоляСтоимостиЗаНалоговыйПериод / СтрокаОСиНМА.КоличествоКварталовВНалоговомПериоде;
			
		КонецЕсли;
		
		СтрокаОСиНМА.ОстаточнаяСтоимость = СтрокаОСиНМА.ОстаточнаяСтоимость
			+ Строка.ОстаточнаяСтоимостьУСН;
		
		РасходыКПризнанию      = Строка.ОстаточнаяСтоимостьУСН * СтрокаОСиНМА.ДоляСтоимостиЗаКвартал / 100;
		СуммаРасходовЗаКвартал = Мин(РасходыКПризнанию, Строка.ОстатокРасходовКПризнанию);
		
		// Заполним информацию в табличной части ОСиНМА.
		СтрокаОСиНМА.СуммаРасходовЗаКвартал = СтрокаОСиНМА.СуммаРасходовЗаКвартал + СуммаРасходовЗаКвартал;
		
		СтрокаОСиНМА.СуммаРасходовЗаНалоговыйПериод =
			СтрокаОСиНМА.СуммаРасходовЗаКвартал * СтрокаОСиНМА.КоличествоКварталовВНалоговомПериоде;
			// гр.13 = гр.12 * гр.9.
		СтрокаОСиНМА.ОставшаясяЧастьРасходов =
			СтрокаОСиНМА.ОстаточнаяСтоимость
			- СтрокаОСиНМА.СуммаРасходовЗаНалоговыйПериод
			- СтрокаОСиНМА.РасходыПрошлыхПериодов;
			// гр.15 = гр.8 - гр.13 - гр.14.
		
		// Заполним информацию о расходах УСН в подчиненной табличной части.
		СтрокаРасходыУСН = ПризнанныеРасходыУСН.Добавить();
		СтрокаРасходыУСН.ИдСтроки = СтрокаОСиНМА.ИдСтроки;
		ЗаполнитьЗначенияСвойств(СтрокаРасходыУСН, Строка, "СчетУчета,РасходыУСН");
		
		СтрокаРасходыУСН.СписатьСумма = СуммаРасходовЗаКвартал;
		
		// Запомним ОС и дату оплаты.
		ТекущееОсновноеСредство = Строка.ОсновноеСредство;
		ТекущаяДатаОплаты       = Строка.ДатаОплаты;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьРасходыПоОСиНМАПриобретеннымВПериодПримененияУСН()
	
	// Получаем оплаченные расходы по ОС и НМА, приобретенным в период применения УСН.
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕПСБУОбороты.Период КАК Период,
	|	ЕПСБУОбороты.Организация КАК Организация,
	|	ЕПСБУОбороты.ИФО КАК ИФО,
	|	ЕПСБУОбороты.КФО КАК КФО,
	|	ЕПСБУОбороты.КПС КАК КПС,
	|	ЕПСБУОбороты.Подразделение КАК Подразделение,
	|	ЕПСБУОбороты.Счет КАК Счет,
	|	ВЫРАЗИТЬ(ЕПСБУОбороты.Субконто1 КАК Справочник.ОсновныеСредства) КАК ОсновноеСредство,
	|	ВЫРАЗИТЬ(ЕПСБУОбороты.Субконто2 КАК Справочник.РасходыУСН) КАК РасходыУСН,
	|	ЕПСБУОбороты.Субконто3 КАК ДокументОплаты,
	|	ВЫБОР
	|		КОГДА &НалоговыйПериодРасширен
	|				И НАЧАЛОПЕРИОДА(ЕПСБУОбороты.Период, ГОД) <> &НачалоГода
	|			ТОГДА 1
	|		ИНАЧЕ КВАРТАЛ(ЕПСБУОбороты.Период)
	|	КОНЕЦ КАК НомерКвартала,
	|	ЕПСБУОбороты.СуммаОборотДт КАК СуммаОборотДт,
	|	ЕПСБУОбороты.СуммаНеУчитываетсяНУОборотДт КАК СуммаНеУчитываетсяНУОборотДт,
	|	ЕПСБУОбороты.СуммаЕНВДОборотДт КАК СуммаЕНВДОборотДт,
	|	ЕПСБУОбороты.СуммаНДСОборотДт КАК СуммаНДСОборотДт
	|ПОМЕСТИТЬ РасходыКПризнанию
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Обороты(&НачалоНалоговогоПериода, &КонецКвартала, Квартал, Счет В (&СчетаРасходовНаОСиНМАкПризнанию), &Субконто, Организация = &Организация, , ) КАК ЕПСБУОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕПСБУОбороты.Организация КАК Организация,
	|	ЕПСБУОбороты.ИФО КАК ИФО,
	|	ЕПСБУОбороты.КФО КАК КФО,
	|	ЕПСБУОбороты.КПС КАК КПС,
	|	ЕПСБУОбороты.Подразделение КАК Подразделение,
	|	ЕПСБУОбороты.Счет КАК Счет,
	|	ВЫРАЗИТЬ(ЕПСБУОбороты.Субконто1 КАК Справочник.ОсновныеСредства) КАК ОсновноеСредство,
	|	ВЫРАЗИТЬ(ЕПСБУОбороты.Субконто2 КАК Справочник.РасходыУСН) КАК РасходыУСН,
	|	ЕПСБУОбороты.Субконто3 КАК ДокументОплаты,
	|	ЕПСБУОбороты.СуммаОборотДт КАК СуммаОборотДт,
	|	ЕПСБУОбороты.СуммаНеУчитываетсяНУОборотДт КАК СуммаНеУчитываетсяНУОборотДт,
	|	ЕПСБУОбороты.СуммаЕНВДОборотДт КАК СуммаЕНВДОборотДт,
	|	ЕПСБУОбороты.СуммаНДСОборотДт КАК СуммаНДСОборотДт,
	|	ЕПСБУОбороты.СуммаОборотКт КАК СуммаОборотКт,
	|	ЕПСБУОбороты.СуммаНеУчитываетсяНУОборотКт КАК СуммаНеУчитываетсяНУОборотКт,
	|	ЕПСБУОбороты.СуммаЕНВДОборотКт КАК СуммаЕНВДОборотКт,
	|	ЕПСБУОбороты.СуммаНДСОборотКт КАК СуммаНДСОборотКт
	|ПОМЕСТИТЬ ОбщиеОборотыНарастающимИтогом
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Обороты(&НачалоНалоговогоПериода, &КонецКвартала, , Счет В (&СчетаРасходовНаОСиНМАкПризнанию), &Субконто, Организация = &Организация, , ) КАК ЕПСБУОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасходыКПризнанию.Организация КАК Организация,
	|	РасходыКПризнанию.ИФО КАК ИФО,
	|	РасходыКПризнанию.КФО КАК КФО,
	|	РасходыКПризнанию.КПС КАК КПС,
	|	РасходыКПризнанию.Подразделение КАК Подразделение,
	|	РасходыКПризнанию.Счет КАК СчетУчета,
	|	РасходыКПризнанию.ОсновноеСредство КАК ОсновноеСредство,
	|	РасходыКПризнанию.ОсновноеСредство.ВидНФА КАК ВидНФА,
	|	ПринятиеКУчету.ДатаСобытия КАК ДатаПринятияКУчету,
	|	ВводВЭксплуатацию.ДатаСобытия КАК ДатаВводаВЭксплуатацию,
	|	Выбытие.ДатаСобытия КАК ДатаВыбытия,
	|	РасходыКПризнанию.РасходыУСН КАК РасходыУСН,
	|	РасходыКПризнанию.ДокументОплаты КАК ДокументОплаты,
	|	РасходыКПризнанию.НомерКвартала КАК НомерКвартала,
	|	5 - РасходыКПризнанию.НомерКвартала КАК КоличествоКварталовЭксплуатацииОбъекта,
	|	ВЫБОР
	|		КОГДА &ЭтоКонецГода
	|			ТОГДА ОбщиеОборотыНарастающимИтогом.СуммаОборотДт - ОбщиеОборотыНарастающимИтогом.СуммаОборотКт
	|		ИНАЧЕ РасходыКПризнанию.СуммаОборотДт / (5 - РасходыКПризнанию.НомерКвартала)
	|	КОНЕЦ КАК СуммаРасходовЗаКвартал,
	|	ВЫБОР
	|		КОГДА &ЭтоКонецГода
	|			ТОГДА ОбщиеОборотыНарастающимИтогом.СуммаНеУчитываетсяНУОборотДт - ОбщиеОборотыНарастающимИтогом.СуммаНеУчитываетсяНУОборотКт
	|		ИНАЧЕ РасходыКПризнанию.СуммаНеУчитываетсяНУОборотДт / (5 - РасходыКПризнанию.НомерКвартала)
	|	КОНЕЦ КАК СуммаРасходовЗаКварталНеУчитываетсяНУ,
	|	ВЫБОР
	|		КОГДА &ЭтоКонецГода
	|			ТОГДА ОбщиеОборотыНарастающимИтогом.СуммаЕНВДОборотДт - ОбщиеОборотыНарастающимИтогом.СуммаЕНВДОборотКт
	|		ИНАЧЕ РасходыКПризнанию.СуммаЕНВДОборотДт / (5 - РасходыКПризнанию.НомерКвартала)
	|	КОНЕЦ КАК СуммаРасходовЗаКварталЕНВД,
	|	ВЫБОР
	|		КОГДА &ЭтоКонецГода
	|			ТОГДА ОбщиеОборотыНарастающимИтогом.СуммаНДСОборотДт - ОбщиеОборотыНарастающимИтогом.СуммаНДСОборотКт
	|		ИНАЧЕ РасходыКПризнанию.СуммаНДСОборотДт / (5 - РасходыКПризнанию.НомерКвартала)
	|	КОНЕЦ КАК СуммаРасходовЗаКварталНДС,
	|	ОбщиеОборотыНарастающимИтогом.СуммаОборотДт КАК ВсегоРасходовКПризнанию,
	|	ОбщиеОборотыНарастающимИтогом.СуммаНеУчитываетсяНУОборотДт КАК ВсегоРасходовКПризнаниюНеУчитываетсяНУ,
	|	ОбщиеОборотыНарастающимИтогом.СуммаЕНВДОборотДт КАК ВсегоРасходовКПризнаниюЕНВД,
	|	ОбщиеОборотыНарастающимИтогом.СуммаНДСОборотДт КАК ВсегоРасходовКПризнаниюНДС,
	|	ОбщиеОборотыНарастающимИтогом.СуммаОборотКт КАК ВсегоРасходовПризнано,
	|	ОбщиеОборотыНарастающимИтогом.СуммаНеУчитываетсяНУОборотКт КАК ВсегоРасходовПризнаноНеУчитываетсяНУ,
	|	ОбщиеОборотыНарастающимИтогом.СуммаЕНВДОборотКт КАК ВсегоРасходовПризнаноЕНВД,
	|	ОбщиеОборотыНарастающимИтогом.СуммаНДСОборотКт КАК ВсегоРасходовПризнаноНДС
	|ИЗ
	|	РасходыКПризнанию КАК РасходыКПризнанию
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СобытияОС КАК ПринятиеКУчету
	|		ПО (ПринятиеКУчету.Событие = ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ПринятиеКУчету))
	|			И РасходыКПризнанию.Организация = ПринятиеКУчету.Организация
	|			И РасходыКПризнанию.ОсновноеСредство = ПринятиеКУчету.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СобытияОС КАК ВводВЭксплуатацию
	|		ПО (ВводВЭксплуатацию.Событие = ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ВводВЭксплуатацию))
	|			И РасходыКПризнанию.Организация = ВводВЭксплуатацию.Организация
	|			И РасходыКПризнанию.ОсновноеСредство = ВводВЭксплуатацию.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СобытияОС КАК Выбытие
	|		ПО (Выбытие.Событие В (ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.Списание)))
	|			И РасходыКПризнанию.Организация = Выбытие.Организация
	|			И РасходыКПризнанию.ОсновноеСредство = Выбытие.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОбщиеОборотыНарастающимИтогом КАК ОбщиеОборотыНарастающимИтогом
	|		ПО РасходыКПризнанию.Организация = ОбщиеОборотыНарастающимИтогом.Организация
	|			И (НЕ &ИспользоватьУчетПоИФО
	|				ИЛИ РасходыКПризнанию.ИФО = ОбщиеОборотыНарастающимИтогом.ИФО)
	|			И РасходыКПризнанию.КФО = ОбщиеОборотыНарастающимИтогом.КФО
	|			И (НЕ РасходыКПризнанию.Счет.УчетПоКПС
	|				ИЛИ РасходыКПризнанию.КПС = ОбщиеОборотыНарастающимИтогом.КПС)
	|			И (НЕ &ИспользоватьУчетПоПодразделениям
	|				ИЛИ НЕ РасходыКПризнанию.Счет.УчетПоПодразделениям
	|				ИЛИ РасходыКПризнанию.Подразделение = ОбщиеОборотыНарастающимИтогом.Подразделение)
	|			И РасходыКПризнанию.Счет = ОбщиеОборотыНарастающимИтогом.Счет
	|			И РасходыКПризнанию.ОсновноеСредство = ОбщиеОборотыНарастающимИтогом.ОсновноеСредство
	|			И РасходыКПризнанию.РасходыУСН = ОбщиеОборотыНарастающимИтогом.РасходыУСН
	|			И РасходыКПризнанию.ДокументОплаты = ОбщиеОборотыНарастающимИтогом.ДокументОплаты
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИФО,
	|	КФО,
	|	КПС,
	|	Подразделение,
	|	ОсновноеСредство,
	|	НомерКвартала,
	|	ДокументОплаты";
	
	НачалоНалоговогоПериода = НалоговыйУчет.НачалоНалоговогоПериода(Дата, Организация);
	Если НачалоНалоговогоПериода = Неопределено
		ИЛИ УчетУСН.НалоговыйПериодПропущен(Организация, Дата) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НалоговыйПериодРасширен", УчетУСН.НалоговыйПериодРасширен(Организация, Дата));
	Запрос.УстановитьПараметр("НачалоНалоговогоПериода", НачалоНалоговогоПериода);
	Запрос.УстановитьПараметр("НачалоГода",              НачалоГода(Дата));
	Запрос.УстановитьПараметр("КонецКвартала",           Новый Граница(КонецКвартала(Дата), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация",             Организация);
	Запрос.УстановитьПараметр("ЭтоКонецГода",            КонецКвартала(Дата) = КонецГода(Дата));
	
	Запрос.УстановитьПараметр("ИспользоватьУчетПоИФО",            ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО"));
	Запрос.УстановитьПараметр("ИспользоватьУчетПоПодразделениям", ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям"));
	
	Запрос.УстановитьПараметр("СчетаРасходовНаОСиНМАкПризнанию",
		БухгалтерскийУчет.СписокСчетов("У01.П,У04.П") );
	
	МассивСубконто = Новый Массив;
	МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ОсновныеСредства);
	МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.РасходыУСН);
	МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ДокументыОплатыУСН);
	Запрос.УстановитьПараметр("Субконто", МассивСубконто);
	
	ОплаченныеРасходыКПризнанию = Запрос.Выполнить().Выгрузить();
	
	// Добавим колонку с датой оплаты.
	ОплаченныеРасходыКПризнанию.Колонки.Добавить("ДатаОплаты",
		ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповДаты(ЧастиДаты.ДатаВремя));
	ОбщегоНазначенияБГУ.ДобавитьДатуДокументаКРезультатуЗапроса(
		ОплаченныеРасходыКПризнанию, "ДокументОплаты", "ДатаОплаты");
	
	// Заполняем документ
	ТекущееОсновноеСредство = Неопределено;
	ТекущийДокументОплаты   = Неопределено;
	
	Для Каждого Строка Из ОплаченныеРасходыКПризнанию Цикл
		
		Если ЗначениеЗаполнено(Строка.ДатаВыбытия) И (НЕ Год(Строка.ДатаВыбытия) = Год(Дата)) Тогда
			Продолжить; // Объект ОС, НМА выбыл в предыдущие годы.
		КонецЕсли;
		
		Если (Строка.ОсновноеСредство <> ТекущееОсновноеСредство)
		 ИЛИ (Строка.ДокументОплаты <> ТекущийДокументОплаты) Тогда
		
			СтрокаОСиНМА = ОСиНМА.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаОСиНМА, Строка,
				"ИФО,КФО,КПС,Подразделение,
				|ОсновноеСредство,ДокументОплаты,ДатаОплаты,ДатаВыбытия");
			СтрокаОСиНМА.ИдСтроки = ОСиНМА.Количество();
			СтрокаОСиНМА.РасходыПроизведеныДоПереходаНаУСН = Ложь;
			
			Если Строка.ВидНФА = Перечисления.ВидыНФА.НМА Тогда
				СтрокаОСиНМА.ДатаВводаВЭксплуатацию = Строка.ДатаПринятияКУчету;
			Иначе
				СтрокаОСиНМА.ДатаВводаВЭксплуатацию = Строка.ДатаВводаВЭксплуатацию;
			КонецЕсли;
			
			// ДатаПодачиДокументовНаГосРегистрацию не заполняем. При необходимости, можно заполнить в документе вручную.
			
			// В течение налогового периода расходы принимаются за отчетные периоды равными долями (пп.3 п.3 ст.346.16 НК РФ).
			СтрокаОСиНМА.КоличествоКварталовВНалоговомПериоде = Строка.КоличествоКварталовЭксплуатацииОбъекта;
			СтрокаОСиНМА.ДоляСтоимостиЗаНалоговыйПериод = 100;
			СтрокаОСиНМА.ДоляСтоимостиЗаКвартал =
				СтрокаОСиНМА.ДоляСтоимостиЗаНалоговыйПериод / СтрокаОСиНМА.КоличествоКварталовВНалоговомПериоде;
			
		КонецЕсли;
		
		// Заполним информацию в табличной части ОСиНМА.
		СтрокаОСиНМА.ПервоначальнаяСтоимость = СтрокаОСиНМА.ПервоначальнаяСтоимость
			+ Строка.ВсегоРасходовКПризнанию
			+ Строка.ВсегоРасходовКПризнаниюНеУчитываетсяНУ
			+ Строка.ВсегоРасходовКПризнаниюЕНВД
			+ Строка.ВсегоРасходовКПризнаниюНДС;
		
		СтрокаОСиНМА.СуммаРасходовЗаКвартал = СтрокаОСиНМА.СуммаРасходовЗаКвартал
			+ Строка.СуммаРасходовЗаКвартал
			+ Строка.СуммаРасходовЗаКварталНеУчитываетсяНУ
			+ Строка.СуммаРасходовЗаКварталЕНВД
			+ Строка.СуммаРасходовЗаКварталНДС;
		
		СтрокаОСиНМА.СуммаРасходовЗаНалоговыйПериод =
			СтрокаОСиНМА.ПервоначальнаяСтоимость; // Все расходы будут признаны в текущем году.
			// При расчете этого показателя по формуле гр.13 = гр.12 * гр.9., т.е.:
			//	СтрокаОСиНМА.СуммаРасходовЗаНалоговыйПериод =
			//		СтрокаОСиНМА.СуммаРасходовЗаКвартал * СтрокаОСиНМА.КоличествоКварталовВНалоговомПериоде
			// могут возникать ошибки округления, поэтому просто берем сумму, отраженную в гр.6.
		
		// Заполним информацию о расходах УСН в подчиненной табличной части.
		СтрокаРасходыУСН = ПризнанныеРасходыУСН.Добавить();
		СтрокаРасходыУСН.ИдСтроки = СтрокаОСиНМА.ИдСтроки;
		ЗаполнитьЗначенияСвойств(СтрокаРасходыУСН, Строка, "СчетУчета,РасходыУСН");
		
		СтрокаРасходыУСН.СписатьСумма           = Строка.СуммаРасходовЗаКвартал;
		СтрокаРасходыУСН.СписатьНДС             = Строка.СуммаРасходовЗаКварталНДС;
		СтрокаРасходыУСН.СписатьНеУчитываетсяНУ = Строка.СуммаРасходовЗаКварталНеУчитываетсяНУ;
		СтрокаРасходыУСН.СписатьЕНВД            = Строка.СуммаРасходовЗаКварталЕНВД;
		
		// Запомним ОС и документ оплаты.
		ТекущееОсновноеСредство = Строка.ОсновноеСредство;
		ТекущийДокументОплаты   = Строка.ДокументОплаты;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
